HKUST-Aerial-Robotics/Teach-Repeat-Replan/controller/djiros/OSDK/Onboard-SDK-3.3/osdk-core/platform/STM32/src/STM32F4DataGuard.cpp
#include "STM32F4DataGuard.h"

using namespace DJI::OSDK;

STM32F4DataGuard::STM32F4DataGuard()
{
}

STM32F4DataGuard::~STM32F4DataGuard()
{
}

void
STM32F4DataGuard::init()
{
}

void
STM32F4DataGuard::lockMemory()
{
}

void
STM32F4DataGuard::freeMemory()
{
}

void
STM32F4DataGuard::lockMSG()
{
}

void
STM32F4DataGuard::freeMSG()
{
}

void
STM32F4DataGuard::lockACK()
{
}

void
STM32F4DataGuard::freeACK()
{
}

void
STM32F4DataGuard::lockProtocolHeader()
{
}

void
STM32F4DataGuard::freeProtocolHeader()
{
}

void
STM32F4DataGuard::lockNonBlockCBAck()
{
}

void
STM32F4DataGuard::freeNonBlockCBAck()
{
}

void
STM32F4DataGuard::lockStopCond()
{
}

void
STM32F4DataGuard::freeStopCond()
{
}

void
STM32F4DataGuard::lockFrame()
{
}

void
STM32F4DataGuard::freeFrame()
{
}

void
STM32F4DataGuard::notify()
{
}

void
STM32F4DataGuard::notifyNonBlockCBAckRecv()
{
}

void
STM32F4DataGuard::nonBlockWait()
{
}

void
STM32F4DataGuard::wait(int timeoutInSeconds)
{
}
